app/views/overview/index.html.erb

    text = ""
    resource_used = Assignment.where(resource_id: res.id).sort_by{|s| [s.task.start, s.task.end]}
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."resource_id" = ?  [["resource_id", 1]]