app/views/assignments/_form.html.erb

  <%= form.label :task %>
  <%= form.collection_select(:task_id, Task.all, :id, :name) %>
---
SELECT "tasks".* FROM "tasks"

  <%= form.label :resource %>
  <%= form.collection_select(:resource_id, Resource.all, :id, :name) %>
---
SELECT "resources".* FROM "resources"