app/controllers/assignments_controller.rb

INSERT INTO "assignments" ("resource_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["resource_id", 1], ["task_id", 3], ["created_at", "2018-12-12 21:20:10.677191"], ["updated_at", "2018-12-12 21:20:10.677191"]]
---
  def create
    @assignment = Assignment.new(assignment_params)

    respond_to do |format|
      if @assignment.save

DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 2]]
---
  def destroy
    @assignment.destroy