app/controllers/overview_controller.rb

  def index
    @projects = Task.all
    @resources = Resource.all
---
SELECT "tasks".* FROM "tasks"
SELECT "resources".* FROM "resources"