app/controllers/tasks_controller.rb

SELECT "resources".* FROM "resources"
---
  def edit
    @resources = Resource.all

INSERT INTO "tasks" ("name", "start", "end", "created_at", "updated_at", "color") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Project Tool"], ["start", "2018-12-13"], ["end", "2018-12-15"], ["created_at", "2018-12-12 06:09:25.147649"], ["updated_at", "2018-12-12 06:09:25.147649"], ["color", "Orange"]]
---
  def create
    @task = Task.new(task_params)
    @resources = Resource.all

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "start" = ?, "end" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["start", "2018-12-15"], ["end", "2018-12-22"], ["updated_at", "2018-12-12 06:10:02.508044"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)